{"classes":["NAME","EMAIL"],"annotations":[["CURRICULUM VITAE General Information ▪ Name : NGUYEN KHAC CHAN ▪ Sex : Male ▪ Date of birth : February 18, 1993 ▪ Address : 69/4/30 Duong Truc St. Binh Thanh Dist. Ho Chi Minh City ▪ Phone : 0167 711 0700 ▪ Email : khacchan@gmail.com Objective § Contribute to the success of the company and the project . § Become a model employee. § Learn and capture work from friends and colleagues. § Develop skills with the development of the project Education 2011 – 2016 University of Information Technology (UIT) Experience in: + Swift, Objective-C + Design Patterns + CustomView + Socials Framework (Facebook, Twitter, G+, …) + Task, Thread + Data offline + Animation + Git Other Technologies: + Java + Python + PHP Interests Mobile technology, football, movies, travelling, guitar.. Skills ▪ Good communication ▪ Can work under pressure to fulfill the task ▪ Can use office software ( word, photoshop…) ▪ Self learning Experience Feb/2015 – Now Working at Vinova, Pte. Ltd Position: iOS Developer iOS Project Attented Project Name Project Description Technologies Team size Application to search jobs, post resume and apply jobs Swift, Socials framework, Skills Tracker online in Australia Charts, Realm, Notification 2 Swift, Animation, Realm, My Medi Square An application to technological Google Map, 4 processes treatment in a hospital chain in India. Application to import duty iFast taxes Objective-C, Core Data 2 Project Project Description Technologies Team Name size Quiz game https://itunes.apple.com/us/app/ Objective-C, Animation SQQuiz sg-quiz/id998817193 effect, Socket 3 Application checking latest stock prices of the companies listed on the Singapore Stock Exchange SGStock (SGX) Swift https://itunes.apple.com/us/app/ sg-stocks/id981372388 3 Jun/2014 - Sep/2014 Working at Sai Gon Mobile Lab Position: Android Developer Android Project Attented Project Name P r o j e c t Description Technologies Team Size \"Gau Tui Dau\" is a dating app that Gau Tui Dau helps single people in Vienam to Java, Socials SDK 2 seek their soul-mate https://play.google.com/store/apps/ details?id=vn.magik.gautuidau Application to find accommodation Java, Google Map, Nha Tro Tot Crawl Data 4 https://play.google.com/store/apps/ details?id=vn.magik.roomrent",{"entities":[[46,62,"NAME"],[215,233,"EMAIL"]]}]]}