{"classes":["NAME","EMAIL"],"annotations":[["TRAN DUC TRINH Date of Birth: 20 January 1988 Address: 14/201A,La Xuan Oai Str, 9 Dist., HCM City. Phone: 01264774647 Email: trinhduc20@gmail.com Marital status: Single CURRICULUM VITAE PERSONAL SUMMARY: Good communication skills and enjoy community activities. EDUCATION Step 2011: University of Technology Education HCM City - Major: Information Technology - Degree: Information Technology Engineers and Certificate of Education. EXPERIENCE: July 2011 - Present: TMA Solutions • Coding • Contact directly to customer to clarify the requirement. • Sharing to the team new technical. • Support other teams in company. Relevant projects: PROJECTS TECHNOLOGIES Swedish Dictionary (iPhone, iPod Touch) Develop a Swedish dictionary. • System Configuration • UIKit, Foundation Key features: • SQLite • Multi-threading • Work look-up • Facebook SDK • Word suggestion • Cross-words search • Bookmark and history • Share on Facebook, via email Duties: • Coding Digital Right Management (Universal) An application to for users can download, buy and play media from app. The media must be • System Configuration encrypted all time to prevent hacker. • UIKit, Foundation Key features: • Core Data • HTTPs Request • Buy and download media from server • AES (Advanced • Play a encrypted media from app Encryption Standard) • Synchronize medias between devices. • Manage media in app. Duties: • Coding • Software Design Specification Dancing to the Beat (iPhone) An entertainment application. The application • System Configuration can make a dancing girl when have music. • UIKit, Foundation • Core Audio Key features: • Cocos 2D • Bluetooth API • Receive audio data • Process data. • Make a dancing girl. Duties: ñ Coding Personal Wage Management (iPhone) An application allows users can manage their • System Configuration job, shift. Beside the app also calculate their • UIKit, Foundation income with knowing rules. • Core Data • Calendar SDK Key features: • Calculate income in weekly, fortnightly, monthly. • Manage jobs and shifts. • Rules configuration Duties: • Coding • Software Design Specification Sky Perfect TV (iPhone, iPad) • System Configuration • UIKit, Foundation An application like TV magazine. User can • Core Data use application to preview channel, program • XML SDK and also can see info of these program. • Twitter SDK • Facebook SDK Key features: • HTTPs Request • XML parser • List of genre, channel, and program. • Search by program name. • Bookmark program name • Watch video program preview. • Share info of program in social network. Duties: • Coding • Software Design Specification Visual Yellow Page (iPhone, iPad) Navigation application, the application allow user can find nearby locations (restaurant, • System Configuration entertainment, school, shops…). • UIKit, Foundation • Core Data Key features: • Location Manager • Facebook SDK • Search nearby locations • HTTPs Request • View detail of location. • Bookmark location • Facebook, email. Duties: • Coding AppPlot SDK • Block • Multitasking Develop a SDK help user developer to handle • UIKit, Foundation hard works with these below functions: • SQlite • HTTP Request Key features: • ORM (Object-relational mapping) • Authentication • Register device UDID for push notification • Synchronization. • Encrypt and decrypt fields of table in local database. Duties: • Coding • Software Design Specification SKILLS AND ACTIVITIES: - Good at English and at requirement analysis. - Experience in writing document and presentation. - Well-organized, creative and capable of performing multiple tasks simultaneously. - Self-motivated and eager to learn. - Good responsibility and teamwork. HOBBIES: - Reading. - Music. * All certificates and related documents will be submitted when required.",{"entities":[[0,14,"NAME"],[125,145,"EMAIL"]]}]]}