{"classes":["NAME","EMAIL"],"annotations":[["Contact Võ Thanh Hoàng Trung Phone : 0837965814  Male ▪ Date of birth : 16 April 1988 Cell: 01689984964 ▪ Place of birth : Binh Dinh E-mail : hoangtrung.uit@gmail.com Address 84/9, street 94, Tan Phu Trung ward, Cu Chi province Ho Chi Minh city Desired Position - Front end web developer Career Objectives - Gaining experience, knowledge PHP frameworks - Improve my personal skills - Becoming a professional in Front-end Web developing. Skills that suitable for your requirement - I have worked as font-end developer for 1 years and 6 months - I’m really strong in jQuery, jQuery ui, Backbone.js MVC framework. - Experience work on Bootstrap and Less - Also can work for PHP framework, such as: Codeigniter & Laravel - Real working with PHPFOX (social network platform) - Have good knowledge about PHP and how to build complete website - Can use photoshop fluently - Can work with many Database management, such as: MySQL, SQL SERVER, ORACLE. Good knowledge about DB INDEX, TRANSACTION, TRIGGER… - Rather good in Listening and Reading skill (TOEIC 625) - Able to think logically, can research, work with new component and new technologies quickly. Experience (May 2012) up to Working as front-end developer for Telcoson Company now Experience on: Javascript: Backbone.js, jQuery, jQuery ui, jQuery mobile. Css: Bootstrap, Less Html and Html5 2012 Associate PHP developer in YouNet company For 4 months Work with social network platform : PHPFOX Education 2007 to 2012 Engineer in Information System (Frebruary 2012) University of Information Technology, VNU-HCM Department of Information System GPA (up to now) : 7.2 Mark in thesis : 8.7 2010 Advanced Java TMA Training Center (Certification with fair level) Foreign Language (1:beginning 5:expert) Language Listening Speaking Reading Writing     English (Toeic 625) 1 2 4 5 1 3 4 5 1 2 3 5 1 2 4 5 Skills Rank Skills Months of Experience (1: Beginning 5:Expert) Programming Languages C/C++ ANSI C 3 ①    2     3       4      5 2 3 4 5 C++ 3 ①    2     3       4      5 2 3 4 5 .NET ADO.NET 3 ①    2     3       4      5 2 3 4 5 C#.NET 6 1 2  4 5 VB.NET 6 1 2  4 5 WEB Design 3 1  3 4 5 Javascript, jQuery, 18 1 2 3  5 jQuery-ui, Backbone.js JAVA 6 1 2  4 5 PHP 36 1 2 3  5 Database Analysis & Design 6 1 2  4 5 MS SQL Server 6 1 2  4 5 My SQL 3 1 2  4 5 Oracle 3 1  3 4 5 Taken projects Project’s name: CONNECT - social network Time: 3 months (October - December/2010) Project Description: Size (number of taken people): 4 Building an social network like facebook with some basic features: create post, comment, add friend, … Programming language: PHP using PHP, MYSQL, AJAX. Database: MY SQL Role:  Database designer  Coder Project’s name: Intellectual Property - Thesis Time: 4 months (October/2011 - January/2012) Project Description: Size (number of taken people): 2 Building an application that provide documents necessary to register Intellectual Property assets and Programming language: C# manage ideas, plans, resources, reports… Database: SQL Server 2008 R2 Role:  Team leader  Database designer  Coder  Interface designer Project’s name: PHPFOX product (social network) – Real project Time: 4 months (May/2012 up to Now) Project Description: Size (number of taken people): 1 Building some phpfox product, such as: Programming language: PHP - User connect: To show members connection path, and Database: MySQL their friends in Five levels, and suggest friends to them. Role: - User profilecompleteness: Show users how many  Developer percent that they completed their profiles, and so Next information that they should have to fill in.  Database designer  Interface designer - Gettingstarted: This is document online help member can understand how the social site run, provide, support, everything about that social site. (Support multiple languages). Project’s name: 8-Force(CRM) – Telcoson Company Time: 14 months (May/2012 to July/2013) Project Description: Size (number of taken people): 6 - 8Force is a powerful, yet simple-to-use business software. We deliver software services to small and Programming language: PHP, Javascript medium businesses around the world. Our core Database: MySQL products include Sales, Invoice, and Helpdesk Framework: Codeigniter, jQuery, Backbone, jQuery ui, Automation. 8Force magnetizes and delights everyone jQuery mobile, Bootstrap. to share, communicate, and work together – in the Role: cloud.  Front-end Developer Website: http://www.8force.com Project’s name: Yummypin (Social network about Fooding)– Telcoson Company Time: 14 months (July/2013 up to now) Project Description: Size (number of taken people): 3 A collective of awesome food photography and tasty descriptives. Create and organize your own personal Programming language: PHP, Javascript yummy space! Database: PostgreSQL Framework: Laravel, jQuery, Backbone, jQuery ui, Less. Turn your Likes into something real. Collect Yummy Role: Coins as you go along and exchange them for real life  Front-end Developer dining privileges. Website: http://www.yummypin.com/ http://about.yummypin.com/ Additional Information Personal Be honest, hard working, dynamic and creative Characteristics Be good at teamwork Be able to work in high pressure and independence Hobbies Play Game, Sport, Guitar Listen to music Surfing the internet in free time Achievements Top 1 scorer award and No.2 football team in high school Champion medals for Dota game ( 2 years consecutive) in University",{"entities":[[8,22,"NAME"],[142,166,"EMAIL"]]}]]}