{"classes":["NAME","EMAIL"],"annotations":[["Dang Ha Tam Developer ..... Sumary Address A29/21,nationalroad I have 2 years of experience in web development, both backend and frontend. I have ex- 50,BinhHung,Binh perience in development of application website, education online system, micro service, Chanh,HoChiMinh asynchronous service. I really have the love of researching new technologies, it is proven throughmanyprojectsthatihaveworked. Tel & Skype Education +84907404471 danghatam 2008-2013 SoftwareEngineering UniversityofInformationTechnology,VietNam Mail Technical Proficiencies danghatam@gmail.com Javascript ReactJS,NodeJS,AngularJS. Web & Git github.com/danghatam Scala Playframework PHP CodeigniterFramework HTML/CSS HTML5,CSS3 OS Linux VCS Git Database Mysql,Postgres,MongoDB,Redis,Neo4j,OrientDB Deployment Docker(beginnerlevel) Soft Skills • Pro-active,selfinitiativeandtheabilitytowork/studyindependentlyandinateam. • Fastlearning. Experience 2/2016-now MocNhienFarm'swebsite Freelancer Ihaveworkingonthisprojectasafreelancedeveoperinteamoftwodevel- opers. It’saflowerfarmwebsite. Thiswebsiteintroducesa flowerfarm. My responsibilityistobuildserverwithnodejs(expressframework). Myroleandresponsibilities: -BuildrestAPIwithnodejs,admin-sidewithReactJS. TechnologiesUtilized: -Nodejs(express),ReactJS. 2/16-now Qanvastwebsite Epsilonmobile-Freelancer Ihavebeenworkingonthisprojectasafreelancedeveloper. It’saarchitec- turalwebsite. IworkwithRectJS.Myresponsibilitysolvesbacklogtasks. 03/15-2/16 GiftHuntApp MyladyBug,VietNam Iworkedonthisprojectabout1yearinateamof4developers. GiftHuntisa applicationsystemwhichrecommendgiftforuser. Myresponsibilitywasboth backend(restapi)andapplicationweb(mobileappwasbuiltbyoutsourcing team). AtGiftHunt,youneedtogiveagifttofriend,butyoudon’tknowwhat should you give, GiftHunt will help you. GiftHunt depends on target’s public infomationstoanalyzeandrecommendforyouagiftlist. Then, youchoose gift and send, system will send notification (anonymous gift) to him/her (if he/sheinstalledapp)andyouwillgotresponse(like/dislike)fromhim/her. GiftHunt server is built with Scala, a strong language in asyncronous han- dling. GiftHuntapplicationWebisdevelopedwithReactJS. Myroleandresponsibilities: -BuildrestAPIwithscala. -BuildapplicationwebwithReactJS. TechnologiesUtilized: -Scala(Playframework). -ReactJS,NodeJS,Webpack. -Postgres,Neo4j, OrientDB,Mongodb. -Docker,Jenskin. -ElasticSearch. 1/15-3/15 Livemix-DeeJayOnline PureSolutions,VietNam Itookpartinthisprojecttosupportrealtimeserver. Livemixisawebapplica- tion,itlivestreamingmusicwhichisplayedbyDeejay. Myprimaryresponsi- bility is support to finish nodejs service for chat, send gift, and something in liveroom. Myroleandresponsibilities: -Supporttofinshnodejsservice. TechnologiesUtilized: -Nodejs,SocketIO,Redis,RubyOnRails,Postgres. Experience 06/14-01/15 Pureed-elearningsystem PureSolutions,VietNam Iworkedonthisprojectfor6monthswithateamof5members. Myprimary responsibilitywastobuildclientside-awebapplicationwithAngularJSand chat/drawservicewithnodejs,Pureedisaonlinechool,whereyoucanlearn anythingyouneed. Besideyoucanregistertoteachifyou’regoodsomething. At pureed, each student/instructor has a timeline - as a social network, a library - include your courses and reference ebooks, a examination room, andthemainroom-liveroom,whereyouhaveliving-learningwithinstructor. Live room have live-stream video, chat-box, realtime multiple-choice, white board. Myroleandresponsibilities: -Buildfront-endapp -Buildchat/drawservice TechnologiesUtilized: -AngularJS,NodeJS,SocketIO. -RubyonRails. -Postgres,Redis, -Grunt,PhusionPassenger. -Cloudinary. -Flashmediaserver. 3/14-6/14 Foodcenter-personalproject Icontinuedtodevelopthisprojectfromamycourseproject. IcalleditFood center. Foodcenterisasocialnetwork,whereeveryonecansharetheirfood porn and favourite place. It help you look at or recommend a restaurant, a streetfoodlocation. TechnologiesUtilized: -PHPcodeigniterframework,googlemapAPI,mysql 01/14-02/14 Unifarm-websiteintroducecompany Freelancer I worked alone about 1 month for this project. I developed it with PHP (codeigniterframework). ThiswebsiteintroduceUnifarm-afarmcompany. 08/12-02/13 Internship Cenvisco,VietNam I worked with asp.net and front-end. My primary responsibility was convert frompsdfiletohtml/csspage. Favorite Sport football,gym,swimming,climbing. Food everythingcaneat Travel discoverandadventure",{"entities":[[0,11,"NAME"],[544,563,"EMAIL"]]}]]}