{"classes":["NAME","EMAIL"],"annotations":[["EDUCATION VIETNAM NATIONAL UNIVERSITY HO CHI MINH CITY 2010 - 2015 UNIVERSITY OF INFORMATION TECHNOLOGY Major: Information System  WORK EXPERIENCE - 2+ years of front-end experience. - Good at Bootstrap Framwork. - Strong experiences in Javascript, Angularjs, Reactjs, Nodejs, jQuery, MongoDB. TRẦN ĐỨC TIẾN Front-end/Full Stack JavaScript  WORKING HISTORY Developer SHINWAY SOFTWARE DEVELOPMENT COMPANY LIMITED 2014 - 2016 Website: http://shinway.vn  August 24, 1992 Position: Software Engineer  Male - Develop the Website with HTML/CSS, javascript, nodejs, angularjs.... - Create design and technical solutions.  0972970075 - Create and execute project work plans and revises as appropriate to meet changing needs and requirements.  ductienas@gmail.com  Ho Chi Minh, Vietnam NAU DIGITAL CREATIVE STUDIO 2016 - Now Website: https://naustud.io Position: Software Engineer OBJECTIVE - Develop the Website with HTML/CSS, javascript, nodejs, angularjs, reactjs.... - Create design and technical solutions. Seeking position of a Front-end or - Create and execute project work plans and revises as appropriate to meet Javascript Developer where I changing needs and requirements. would be able to put to use the knowledge gained in the software development cycle and technical  TYPICAL PROJECTS aptitude. MAGPIE TRAVEL SKILLS A global community of women who love to travel. Meet travel gal pals for global adventures. HTML5/Jade/Handlebars Demo Link Team size 8 CSS3/LESS/SASS My position Developer - Analysis and design Nodejs - Development My - Review code LoopBack responsibilities - Optimize code - Update - Bug Fixing Reactjs - Angularjs 1 - nodejs Angularjs Technologies - HTML/CSS used - MongoDB MongoDB - Boostrap RethinkDB ARCO One Page HTML Template. INTERESTS Demo Link Team size 2 Reading books My position Developer Music - Analysis and design - Development Traveling My - Review code responsibilities - Optimize code - Update - Bug Fixing - HTML5/CSS3 Technologies - Jade/less used - jQuery - Boostrap MTEK Admin Template Bootstrap + AngularJS. Demo Link Team size 3 My position Developer - Analysis and design - Development My - Review code responsibilities - Optimize code - Update - Bug Fixing - Angularjs 1 - HTML5/CSS3 Technologies - Jade/less used - jQuery - Boostrap MADMIN Multi Style AngularJS Admin + Frontend. Demo Link Team size 3 My position Developer - Analysis and design - Development My - Review code responsibilities - Optimize code - Update - Bug Fixing - Angularjs 1 - HTML5/CSS3 Technologies - Jade/less used - jQuery - Boostrap",{"entities":[[294,307,"NAME"],[735,754,"EMAIL"]]}]]}