{"classes":["NAME","EMAIL"],"annotations":[["CURRICULUM VITAE Name: Nguyen Thanh Trung Date of birth: 19/08/1983 Sex: Male Married Status: Married Add: Hoang Liet-Hoang Mai-Hanoi Email: trungnguyenthanh70@gmail.com Mobile : 0983987498 I. EDUCATION, TRAINING AND SKILL - Bachelor of IT Department of Phuong Dong University. - Let’s talk course of London Language Center (Thai Ha Branch). - Other courses : Web Design, make HTML & CSS, HTML5 & CSS3, - Skill: Design web cut and match website CSS. I can use framework Twitter Boostrap, Less ,960 grid framework,htm5 & css3, make theme Wordpress, Opencart, Joomla,magento,jquery,php basic.. make HTML & CSS Validate W3C, can use SVN and GIT II. EXPERIENCE 1. VietSoftware International Inc. ( 6th Floor, Toyota Building, 15 Pham Hung Road, Tu Liem , Hà Nội , Viet Nam ) Title: Web Developer. Task: Design web,convert psd file to html,css . Convert htm,css to wordpress, make theme for wordpress, joomla CMS 2. eXoPlatform SEA (7th & 8th Floors ,18/11 Thai Ha Street, Dong Da District, Ha Noi,Viet Nam ) Title: Web Developer Task: Design web, cut and match web (HTML, CSS), use framework bootstrap, manage product of company CS,Forum, Socail, ECMS, Portal, PLF4. Support other team III.PROJECT Name Duration Technology Role Responsibility PLATFORM 2010-2012 Design/HTML/ Developer Convert design 3.0.x CSS /java file to html/css. (http:// template Manage exoplatform.co html,css. m/) Support other team use structure html correctly PLATFORM 2012-2014 Design Developer + Update layouts 40.x /HTML/CSS/L Technique for PLF4.0.x . (http:// ess/boostrap/jav leader Manage exoplatform.co a template less ,css ..Supp m/) ort other team use structure html correctly Mariosarti 2013 Desgin/ Freelance Create (http:// Wordpress / (Leader) restaurant site mariosarti.com. html5/css3 with responsive au/) function . Use Wordpress CMS. This is responsive site (display well on mobile, table, desktop) fergusonplarre 2013 Magento Freelance This is (http:// (developer) ecommerce fergusonplarre. site. My nx.smartosc.co Responsibility m/ ) . is Convert design file to username/pass Magento CMS word: magento/ magento Statewideriver 2013 Joomla/T3 Freelance Statewide River s Framework/Les (Leader) and Stream (http:// s/Jquery Management www.devsite.co Pty Ltd actively m.au/ promotes and statewiderivers/ encourages ) environmental awareness and prides itself on its involvement in many waterway rehabilitation projects throughout Victoria. My Responsibility is : Convert design file to Joomla CMS. This is responsive site (display well on mobile, table, desktop) picobarn 2013 Wordpress/ Responsive Convert design http:// Html5/css3/ Web Designer file to picobarn.com/ jquery wordpress about-us/meet- CMS.This is our-team/ responsive site (display well on mobile, table, desktop) cherricompute 2013 opencart Freelance This is rs (Leader) ecommerce http:// site. My www.cherrico Responsibility mputers.com/ is Convert design file to Opencart CMS IV. TARGET - Contribute to Company’s Developing. - Always make plans, strategy for myself. - Get good relationship and improve personal skill. IV CHARACTERISTIC AND CAPACITY - Truthful, hardworking, decisive - Enthusiasm, sympathetic, creative - Careful, resourceful. - Self-confident. - Work independently as well as work in team, make plan, control time, job. - Willing to co-operate other department, support to each other.",{"entities":[[23,41,"NAME"],[141,169,"EMAIL"]]}]]}