{"classes":["NAME","EMAIL"],"annotations":[["PPhhạạmm NNgguuyyễễnn PPhhúúcc CChháánnhh FULL STACK DEVELOPER Career Objective - Working in a professional, young and dynamic environment where I'll have the opportunities to develop my skills, learn new technologies and contribute as much value as I can. - To be a good member and working with company for a long time.  Education UNIVERSITY OF SCIENCE 10/2016 - 2020 Major : Technical Physics and Computer Science  05/03/1998 ACTIVITIES 2019 - PRESENT  Male + My Project: https://github.com/phamchanh6599 + Practicing Algorithm: https://www.codewars.com/users/phamchanh6599  0395051671  phamchanh6599@gmail.c  Work Experience om  Protected Data LAIHO & CAO SOFTWARE COMPANY 10/2018 - 10/2019 Position: Employee (Full Stack Developer).  https://www.linkedin.co - Working based on instruction of Team Leader : . m/in/ch%C3%A1nh-ph%E + Working with Angular framework to build single page web apps that 1%BA%A1m-958116152/ communicate with backend via Restful API. + Working with Vue Js, React Js framework to build single page web and using PHP to write API. SKILLS + Improving company's production using Angular 7 and using Git to communicate with other developers. HTML - CSS/SASS + Improving performance of website using lazyloading. + Developing and fix the application’s defect base on requirements + Developing small modules of the system JAVASCRIPT NEW OCEAN INFORMATION SYSTEM COMPANY LIMITED 10/2019 - 01/2020 VUE JS Position: Freelancer (Front End Developer). - Working based on instruction of Team Leader : . REACT JS / REDUX + Working with React js to build client side from beginning to end and using Node js to create Rest API in server side. + Working with Vue Js to build CRUD application from beginning to end and GRAPHQL using GraphQL to connect with Backend. + Researching D3 Js to draw charts instead of Power Bi. ANGULAR + Improving internal application using React js. + Supporting other members using Blazor to build interactive client-side web UI. NODE JS + Working within the Scrum/Agile development methodologies to find the best way to make application better. MY SQL COVERGO 02/2020 - PRESENT Position: Employee (Front End Developer). TAILWIND - Working with CoverGo team in HongKong : . + Working with Vue js to build client side in server-side render from JEST beginning to end depend on current platform of company. + Working with Vue Js to build CRUD admin application from beginning to end and using GraphQL to connect with Backend. ENGLISH + Implementing a little bit UI/UX based on requirement of client on Figma. + Working within the Scrum/Agile development methodologies to find the best way to make application better.  Certificate + \"Programing Web HTML5, CSS3, JQuery and Bootstrap\" 2018 by University of Science.  Projects 0. WEB APP: https://www.luminpdf.com/ + Team Size: 7 + Position: Front end developer. + Project Description: A web app allow you to brings your documents to life with smart editing and markup tools to help you easily annotate PDF documents and images. Add text, images, comments, shapes and signatures. All from your browser in realtime. + Technologies: React Js - Redux - Webpack - Docker - Nodejs - MongoDB - Redis - Graphql. + Responsibilities: --> Communicating with designer to implement UX/UI. --> Developing and fix the application’s defect base on requirements. --> Improving some features which dont work correctly. --> Refactoring some modules better. 1. ECOMMERCE WEBSITE: https://y5buddy.sg/ + Team Size: 6 + Position: Front end developer. + Project Description: y5buddy is a mobile wi-fi rental service for corporates and individual travellers since 2013. + Technologies: Angular 4 - Node Js - MongoDB. + Responsibilities: --> Using Html, Sass, Bootstrap to create pricing view, corporate, how to use, create account, sign in. --> Using Typescript to make some animations and features in UI. --> Using git communicate with other front end developers. --> Using photoshop to cut images, measure unit and convert PDF file to HTML file. 2. WEB APP: https://nettivaraus6.ajas.fi/en/77e047df962b?view=compact. + Team Size: 5 + Position: Front end developer. + Project Description: An onlne booking system for many industries. + Technologies: Angular 7 - PHP - MySQL - Docker - Laravel. + Responsibilities: --> Using Html, Css, to make User Interface of Small view, Legacy view and Spatial view. --> Using Typescript to connect with Backend via Restfull API --> Using moment library to analyse time and show to UI --> Using canvas to draw table for booking ( Spatial view) --> Deploy production to server using WinSCP in Window 10 3. WEB PAGE: http://dgitool.com/ + Team Size: 2 + Position: Fullstack developer. + Project Description: This tool is designed for Dividend Growth Investors to analyze performance of stocks and portfolios using compounding interest and reinvestment of dividends. + Technologies: Vue Js - PHP - Slim - MySQL. + Responsibilities: --> Using Html, Css, Bootstrap to make UI --> Using Javascript and Axios Library to comunicate with BackEnd via Restful API --> Using SVG to make and show dynamic chart based on data from user --> Deploy production to server using FileZilla in Linux --> Doing Unit test --> Using PDO to connect database ( MySQL) --> Making Read and Write methods --> Using FPDF library to make PDF --> Fetching data from another website using IEX API based on data of user 4. WEB SITE: https://muangthai-uat.quote.hk/ + Team Size : 5 + Position: Front End developer. + Project Description: A website to show some products about insurance. + Technologies: Vue js - .Net - Tailwind - GraphQL + Responsibilities: --> Disscusing with team Leader to create UI / UX --> Using Vue js to create UI and handle logic for each page --> Connect with Back end via GraphQL 5.WEB APP: https://tahoe-uat.quote.hk/en/e-protector-term/ + Team Size: 4 + Position: Front developer + Project Description: A insurance web allow user to select and buy product for anyone. + Technologies: Vue js - .Net - Tailwind - GraphQL + Responsibilities: --> Communicating with customers and teammates to clarify requirement --> Building client side using Vue js from beginning to end. --> Design UX/UI and implement the solution based on the requirements from stakeholders2. © topcv.vn",{"entities":[[0,41,"NAME"],[589,610,"EMAIL"]]}]]}