{"classes":["NAME","EMAIL"],"annotations":[["Curriculum Vitae POSITION APPLIED: PERSONAL RECORD Name : TIEN DO QUYET Date of Birth : 10/11/1991 Place of Birth : Phu Tho Address : No.34, 358 Alley, Bui Xuong Trach Street, Thanh Xuan Dist., Hanoi, Vietnam. Sex : Male Female Marital Status : Single Tel : (84) 988 928 863 E-Mail : Tiendo1011@gmail.com WORKEXPERIENCE 2016 THE KLOUDERY Hanoi, Vietnam Full-stack Javascript Developer (05/2016-now) Main responsibility:  Setup server, develop a system from Back-end to Front-end base on an open source project.  Help connecting the system with the Docker API. What I have learned:  The ability to work in a 100% English environment.  Improve my knowledge about the overall system, especially my Javascript skills. 2015-2016 YAMAGUCHI VIETNAM Hanoi, Vietnam IT manager (04/2015-now) Main responsibility:  Take care for the company’s IT system. What I have learned:  The practical knowledge about Windows Server 2008 R2 and the IT system. 2014-2016 Tienganhgiaotiepthaytien.com Hanoi, Vietnam Teacher (05/2014-now) Main responsibility:  Help students achieve their goal in speaking English. What I have learned:  The ability to communication with students. 2014 YAMAGUCHI VIETNAM Hanoi, Vietnam Sales staff (02/2014-10/2014) Main responsibility:  Sale lab equipment, car washing machine, precision engineering products to Vietnamese and Foreign customers. What I have learned:  Based knowledge about sales field.  The communication skills with the team & customers. 2012-2013 LENGUYET.VN-ENGLISH TEACHING COMPANY Hanoi, Viet Nam Tutor (04/2012-01/2013) Main responsibility:  Help students to correct their pronunciation before they come to next lesson.  Createevent if it comes to some special days like: Women’s day, Halloween, Hollywood star English contest …  Worked in team (designers and accountants) to create new ideas of event organizing style and manage event budget. What I have learned:  .Communication skills, Relationship and Networking Skills are very important. Then, I try to improve these skills, open my Relationship and Networking as much as possible. 2010-2011 FREELANCER Tutor:Teaching physics, mathematics, chemistry for students in high school and secondary school. What I have learned:  How to motivate my students (sometimes they feel frustrated from their parent’s pressure) and orient them toward the result (if not, they could get into temptation and fail to overcome the university entrance test). ORGANIZATIONALANDCOMMITTEEEXPERIENCES 2012-2013 VEEC ENGLISH CLUB Key member and MC (Master of Ceremony): Composed topic contents and guided and managed discussions at meetings of 25-30 members, organized events for club occasionally.  Conducted 2-4 sessions per months  Head manager created some events for every members in the whole class: Halloween, Women’s day, Christmas . . . 2012 COUCH SURFING HA NOI Supported foreigners by assisting their lives in Viet Nam EDUCATION 2009-2013 ACADEMY OF FINANCE Hanoi, Viet Nam Bachelor degree of Finance and Banking  GPA: 7.58  Membership at Seamap, Advance, VEEC, GALEC English Club OTHERS  Backpacking through 4 countries in a row on a budget of 700$.  IT software, hardware and Code writing",{"entities":[[58,71,"NAME"],[284,304,"EMAIL"]]}]]}