{"classes":["NAME","EMAIL"],"annotations":[["NGUYEN DUC TRI +84 383-514-104 · Ho Chi Minh City, Vietnam tri14102004@gmail.com · linkedin/sh1nata · github/sh1nata-piash1nlin OBJECTIVES PROJECTS Crab Age Prediction - Kaggle Competition - Side Project (1 member) Dec, 2023 Description: The aim of this project is to estimate the age of crabs accurately based on a range of crab-specific physical attributes. Framework: Scikit-learn Responsibilities: Conducted an in-depth investigation into predicting the age of crabs by performing comprehensive data preprocessing, leveraging advanced machine learning algorithms, fine-tuning hyperparameters, evaluating model performance, and implementing strategies to enhance prediction accuracy. Repository: github.com/sh1nata-piash1nlin/Crab-Age-Prediction Vietnamese Currency Recognition - Side Project (1 member) Dec, 2024 Description: Developed a deep learning-based system to recognize Vietnamese banknotes, aimed at assisting visually impaired individuals in identifying currency using computer vision techniques. Framework: Pytorch, Torch, OpenCV, Scikit-learn. Responsibilities: Designed and trained a VGG-based CNN model using PyTorch, implemented preprocessing pipelines with OpenCV, evaluated model performance with Scikit-learn to ensure robust classification of various denominations and used some methodologies to enhance the model’s accuracy. Reposistory: github.com/sh1nata-piash1nlin/VGG-pytorch UNET for Brain MRI Segmentation - Side Project (1 member) Dec, 2024 Description: Utilized a UNet-based deep learning model to perform precise segmentation of brain tumors from MRI scans, aiming to assist medical professionals in early diagnosis and treatment planning. Framework: Pytorch, Torch, OpenCV. Responsibilities: Designed and trained a UNet architecture tailored for medical image segmentation, conducted extensive data preprocessing including skull stripping and intensity normalization, implemented augmentation strategies to improve model robustness, and evaluated performance using metrics such as Dice coefficient and IoU. Reposistory: github.com/sh1nata-piash1nlin/UNet-pytorch Deeplabv3 - Side Project (1 member) Dec, 2024 Description: Developed a semantic segmentation system using DeepLabV3 to accurately segment brain tumors from MRI scans, facilitating medical diagnosis through automated analysis. Framework: Pytorch, Torch, OpenCV. Responsibilities: Implemented and fine-tuned a DeepLabV3 model tailored for medical image segmentation, performed extensive preprocessing including bias field correction and normalization, applied data augmentation to enhance generalization, and evaluated performance using metrics such as IoU and pixel accuracy. Reposistory: github.com/sh1nata-piash1nlin/Deeplabv3-Pytorch SKILLS Language: Python, C++, C# Frameworks & Library: Pytorch, Scikit-learn, OpenCV, Torch Database: MySQL Tool: Git, Figma, Docker Soft Skills: Communication, Problem-Solving, Presentation, Teamwork, Self-Study. EDUCATION Ho Chi Minh University of Technology and Education - HCMUTE 2022 - Present Major: Information Technology GPA: 3.44/4.00 CERTIFICATIONS IELTS Dec, 2021 Band: 6.0",{"entities":[[0,14,"NAME"],[59,80,"EMAIL"]]}]]}