{"classes":["NAME","EMAIL"],"annotations":[["CURRICULUM VITAE PERSONAL DETAILS (Please type in English) Full Name Hoàng Văn Dương Job Titles Team leader Date of Birth 08/11/1988 Place of Birth Xuan Truong ,Nam Định Gender Male Ảnh 4* 6 Marital Status Single Home Address Mễ Trì Street, Từ Liêm Dis, Hà Nội Home Phone (+04) Cell phone (+84) 1672.414.515 Email duonghv@fsoft.com.vn EDUCATION HISTORY From: 2006 To:2008 Việt Nam National Economic From:2007 To:2011 FPT University EMPLOYMENT HISTORY (Start the nearest company) From: 2/2010 Company name FPT Software Job title Project manager of android project To: Present Estimate; create Plan, Design, and Review, Communication in Job description android projects of Japanese customer. From: 8/2008 Company name FPT Software Job title Developer To: 1/2010 Job description Develop application in C++ projects From: Company name Job title To: Job description ATTENDED PROJECTS (Start latest work ) From: 2/2012 Project Name TJ.PhoneApp To: present Company FPT Software Client Toshiba communication Project Size 15MM(Man/Month) Position Project Leader Create Plan, requirement manager, Architecture design, review coding, Responsibilities design…. Develop , customize function for Fujitsu Project Description android mobile Used Programming Languages Java Used Technologies Android From: 4/2012 Project Name 1040i/ 10 weather To: 9/2012 Company Freelancer Client US Company Project Size 4MM Position Project Leader Coding Responsibilities Project Description Develop 2 applications for organization Market link: https://play.google.com/store/apps/ details? id=com.mike.i1040&feature=search_res ult#? t=W251bGwsMSwxLDEsImNvbS5taWt lLmkxMDQwIl0. https://play.google.com/store/apps/ details? id=com.gof.oklahoma.android&feature= search_result#? Used Programming Languages Java Used Technologies Android From: 11/2011 Project Name Multilanguage To: 02/2012 Company FPT Software Client Panasonic mobile communication Project Size 50MM(Man/Month) Position Project Leader/ Onsiter(Working in japan) Create Plan, requirement manager, Create support tool, configure environment at Responsibilities Panasonic company (at Japan) Develop to support all languages on Project Description Panasonic mobile. Used Programming Languages Java Used Technologies Android/.Net From: 4/2011 Project Name Telephony enhancement To: 9/2011 Company FPT Software Client Panasonic mobile communication Project Size 12MM(Man/Month) Position Project Leader Create Plan, requirement manager, Design, review product, communication with Responsibilities customer Project Description Develop Lock IC Card function for Telephony application for Panasonic mobile Used Programming Languages Java/C/ C++ Used Technologies Android From:8/2011 Project Name RunningApp To: 10/2011 Company FPT Software Client SoftBank Project Size 12MM(Man/Month) Position Supporter Clear Requirement, Support solution Responsibilities Develop application on smart Project Description phone(IPhone/Android) which is used in Olympic 2012 at Japan Used Programming Languages ObjectC/Java Used Technologies Android/ IOS From:07/2011 Project Name ChatApp To: 9/2011 Company Freelancer Client Kotosoft (Japanese) Project Size 8MM Position Project Manager Estimate, Requirement manager, design, coding, review, communication with Responsibilities customer Project Description Developing chat application which use XMPP. Used Programming Languages Java/Object C Used Technologies Android/IPhone From 5/2011 Project Name Gold Auction To: 7/2011 Company Singapore company Client Singapore company Project Size 3MM Position Developer Responsibilities Design, coding Developing website for goldern company Project Description which is used for auction Used Programming Languages .Net Used Technologies ASP.net From 10/2010 Project Name Decomail To: 03/2011 Company FPT Client Seraku Project Size 20MM Position Developer/Teamleader Design, coding Responsibilities Project Description Develop mail application which can add/send animation icon. Market link: https://play.google.com/store/apps/details? id=net.deco2.sp_mailer.free&feature=sear ch_result#? t=W251bGwsMSwxLDEsIm5ldC5kZWN vMi5zcF9tYWlsZXIuZnJlZSJd Used Programming Languages Java Android Used Technologies From 8/2010 Project Name Macdep.vn To: 10/2010 Company Macdep Client Fashion company Project Size 3 Position Developer/Team leader Responsibilities Design, coding Developing website for fashion company. Project Description PHP, ExtJS Used Programming Languages Used Technologies From: 10/2008 Project Name Pavion To: 1/2011 Company FPT Software Client Panasonic semi conductor Project Size 400MM Position Developer Responsibilities Develop some modules Develop simulator program to test Board Project Description Used Programming Languages C/C++ Used Technologies MFC Project Name Company Client Project Size From: Position To: Responsibilities Project Description Used Programming Languages Used Technologies TECHNICAL COMPETENCIES (Box blank if you do not know) Used Programming 1 2 3 4 5 Languages Experience 1 – 6 6 – 12 1 – 2 2 – 5 > 5 years Used Technologies months months years years Last used 1 2 3 4 5 Expert level Beginner Always have to use Sometimes have to Can solve Expert manuals use manuals problems Expert level Experiences Last used 1 2 3 4 5 PROGRAMMING LANGUAGE 2008/201 Java (JSP, EJB, Servest) 5 4 0/2011 .Net (C #, ASP.Net, VB.Net) 3 2010 3 2008/200 C/C++ 4 4 9 Visual C++ 4 4 Object C PHP Perl/Python Java Script VB Script/Cold fusion/ AJAX Power Builder/ Delphi/Assembly/ FoxPro HTML/XML/XSLT COM/COM+ Databases 2010 SQL Server 3 x SQLite 2011 5 Access Plaform all Window xp/2003 x 5 Linux 2011 4 Mac 2011 4 Tools Microsoft Visual Basic 6.0 Microsoft Access 97 MS SQL Server 2000 Enterprise manager Rational Rose 2000e Rational XDE Microsoft Visual Studio.NET xCode FOREIGN LANGUAGES 0 1 2 3 4 5 Experience 1 – 6 0 month 6 – 12 months 1 – 2 years 2 – 5 years > 5 years months Last used 1 2 3 4 5 Expert level Beginner Conversational Fluent Expert Translator Languages Certificate Last use Expert level 1 2 3 4 5 Vietnamese Native speaking 2010 x English 4 OTHERS Spoken and Written Good Communication Inter-personal skills Good SIGNATURE I certify that the information declared above is true to the best of my knowledge and belief. Hanoi, 2010 Signature Hoang Van Duong",{"entities":[[69,84,"NAME"],[314,334,"EMAIL"]]}]]}