{"classes":["NAME","EMAIL"],"annotations":[["PROFILE CONTACT INFORMATION Name: Hoang Dung Phi Gender: Male Address: 4/17 Do Son, 4th Ward, Tan Binh District, Ho Chi Minh City Email: hoangdungphi2511@gmail.com Cell: 01224972289 PERSONAL INFORMATION Image Date of birth:25-11-1990 Nationality: Vietnam Marital status: Single Education: University Foreign language: English Identity card: 273372063 EDUCATION I also have TOEIC certificate with total score is Listening: 255– Reading: 195, Proskill in SHTP Training Center HCM, graduated IT in SaiGon University, graduated IT in Infoworschool and graduated Android Developer in Computer Center University Of Science Ho Chi Minh. POSITION Junior developer mobil ACADEMIC QUALIFICATION  10/2012 graduated IT in SaiGon University.  10/2014 graduated IT in Infoworschool.  2/2016 graduated Android Developer in Computer Center University Of Science Ho Chi Minh.  Microsoft Certified Professional (MCP)  70-526: Microsoft .NET Framework 2.0 - Windows-Based Client Development  70-548: Designing and Developing Windows-Based Applications by Using the Microsoft .NET Framework  70-536: Microsoft .NET Framework - Application Development Foundation Page   1 PRACTICAL EXPERIENCE IN WORK Project: 1. .”Project Calofic ”. Language: Sql server 2012, Ms Navision , java script(ext.net, ), C#, ERP in FPT Software. Role: Fix bug, developer new modul, knowledge BA. (8 year) 2. Project mobil in Viet Uc Electronic-Trading(1.5 year) a. Project android: i. Gamecard on CH Play (esclipe and Android studio)  Đăng nhập: Facebook, google and yahoo.  Menu sản phẩm  Trang Sản phẩm  Giỏ hàng  Liên hệ  Khuyến mãi: Google Cloud Messaging  Thanh toán : onecom, Paypal  Server: php và mysql ii. Vnsupermark on CH Play (esclipe and Android studio)  Đăng nhập: Facebook, google and yahoo.  Menu sản phẩm  Trang Sản phẩm  Điểm danh hằng ngày  Giỏ hàng  Liên hệ  Khuyến mãi: Google Cloud Messaging  Thanh toán : onecom, Paypal  Server: php và mysql b. Project ios: i. Gcvae on App Store (object C)  Đăng nhập: Facebook.  Menu sản phẩm:  Trang Sản phẩm:  Giỏ hàng:  Liên hệ:  Khuyến mãi  Thanh toán : onecom, Paypal  Server: yii framework và mysql 3. Project game in Viet Uc Electronic-Trading(6 month) a. Unity b. Server: Node js, socket io. Page   2 SKILLS - Object C, swift in xcode. - Java in android studio/Esclipe. - Mysql. - Yii framework. - Node js. - C# in unity. - Good understand of OOP programming - Experience up app on the App Store, CH Play ACTIVITIES - Leader infoworldschool student. - 60 Earth hour MORE INFORMATION - Expertise in application developing, mobil developing. Self starter, creative, dynamic, enthusiastic, team player, dependable with strong skills in problem solving. - Good English verbal and reading. - Able to quickly learn new technologies, High logical thinking ability skills, keen on researching and discovering new programming languages as well as techniques related to computer. Ability to work under pressure and work on tight deadline with the demand of fast moving environment. - Hobbies:Computer , reading book, table tennis, football, Music ... Page   3",{"entities":[[34,48,"NAME"],[137,163,"EMAIL"]]}]]}