{"classes":["NAME","EMAIL"],"annotations":[["An Nguyen Email:an.cse09@gmail.com 45/13 Street 42, Linh Dong ward, Thu Duc Skype: an.cse09 district, Ho Chi Minh city. (+84) 0988-377-459 DoB: August 15, 1991 Education (cid:5) HCMCUniversityofTechnology,HoChiMinhCity,VN (Sep 2009 - Dec 2013) Bachelor of Engineering in Computer Science and Engineering (GPA: 8.1). Advisor: Dr. Tri Dang The program is accredited by the Engineering Accreditation Commission of the American Board for Engineering and Technology (ABET). Work (cid:5) Software Engineer, SoftfoundryInternationalPteLtd (June 2013 - Now) experience Worked as a back-end web developer, built some Android and iOS applications. (cid:5) Interne, KMS Technology. (Jul - Dec 2012) Developed an automation testing tool using MVVM pattern design with WPF of .NET framework. Personal (cid:5) ProgrammingLanguages: PHP,Java,Python,Objective-C,C/C++,C#,WPF,HTML5, Skills CSS, Prolog, Scala. (cid:5) Framework: Yii, ElasticSearch, Docker, Android SDK, XCode SDK, ASP.NET, Rails (Ruby on Rails), jQuery, ReactJS, AWS. (cid:5) Operating system: Windows, Linux, MAC, Android, iOS. (cid:5) Database: MySQL, Oracle, NoSQL (MongoDB, Cassandra). (cid:5) Database: GIT, SVN. Other (cid:5) English: Proficiency in reading material and writing reports in English. Skills (cid:5) Research: Keen on research and good ability of self-study. (cid:5) Teamwork: · Capable of teamwork and effective communication. · Open-mind in discussing. · Honest in working and in relation with others. Ongoing (cid:5) Location Based Service (Softfoundry:Dec 2015 - now) Projects The system allows users to find locations surrounded them in a specific distance. I use ElasticSearch to store location information and to search for nearest location in real time. I also help to build a hosting file server to store media file such image, video, etc. Technology: ElasticSearch, Java Finished (cid:5) HaloDoc (Softfoundry:June 2015 - Nov 2015) Projects The application core functionality is to support communications between doctors and pa- tients. Communication could be done through chatting, voice call, and video call. I help to create APIs for mobile apps, website to use and communicate each other. Technology: Yii framework (cid:5) Multipath TCP (Softfoundry:Jan - May 2015) Multi-path TCP (MPTCP) is an effort towards enabling the simultaneous use of several network interfaces by a modification of TCP that presents a regular TCP interface to ap- plications, while in fact spreading data across several sub-flows. An Nguyen I applied this protocol on Linux server and android phone to make use of both 3G and Wi-Fi on the phone and many network interfaces on server side. This helps increase the bandwidth on both android phone and server. (cid:5) B2B e-comerce website (Softfoundry:Apr - Dec 2014) I implemented the recommendation service using Mahout framework, which can deploy the service on Hadoop distributed network. Technology: Yii framework (web service project), Mahout framework. (cid:5) City wifi (Softfoundry:Aug 2013 - Mar 2014) Inthisproject,weimplementasystemtomanageawirelessnetworkforacity. IuseTR069 protocol to remotely control access points. Technology: Yii framework (web service project), TR-069 protocol. (cid:5) Search and comparing engine for on-sale products (HCMUT: Feb - Dec 2013) I built a search engine from scratch. This system crawls on-sale products from on-line stores and save product information into system database. The searching products will be displayed in order of price. User can also make comparison between products if they want. Besides, recommendation service is applied to recommend products that user may like. Technology: Yii framework, bootstrap library, recommendation algorithms. (cid:5) Funny photo (HCMUT: Sept - Dec 2012) Funny Photo is an Android application which provides a lot of image effects and frames. User can use our application to create funny photos and share it on Facebook. Technology: Android SDK. (cid:5) qAutomate (KMS Technology: Jul - Dec 2012) This desktop software help testers to manage test cases, test suites and auto execute these test cases. Technology: WPF framework, C#, MVVM design pattern. Research (cid:5) Data Science Interests (cid:5) Networking performance Honors & (cid:5) Good student title, Ho Chi Minh City University of Technology (2010 - 2011) Awards This title is for students who have GPA above 8.0 for both semesters in an academic year and good performance in social activities. (cid:5) Scholarship of Nam Long Group (June 2011) Thisscholarshipisforstudentswhohavegoodperformanceinstudyatuniversityandsocial activities. (cid:5) Scholarship of VNPT group (May 2012) This scholarship is for students who have good performance in study and social activities. It aims to encourage the study among students. (cid:5) Valedictorian of the high school graduation exam (July 2009) Highest score of the Graduation Exam in high school. Teaching (cid:5) KTLT 13: Fundamental Programming experience Ho Chi Minh City University of Technology, Spring 2014, Teaching Assistant Activities (cid:5) Volunteer for DEP (Data Entry Project), (Jul - Dec 2012) Project was held by SIFE group of Foreign Trade University of Ho Chi Minh City. Helped unemployed women to do data entry work by teaching them the basic knowledge of com- puting: Microsoft Office Word and Excel 2007. (cid:5) Volunteer for SSEAYP, (December 2010) Worked as a volunteer to guide the ASEAN youths in SSEAYP (Ship for South East Asian Youth Program) when they visited my university (HCMUT). (cid:5) Volunteer for HCM City Summer Campaign, (July 2011 August 2011) In this campaign, I worked as a tutor to help children from poor families in Ho Chi Minh city. I taught Math, Physic and English. An Nguyen (cid:5) Volunteer for University Entrance Consulting, (December 2010) Volunteeredtohelpgrade-12studentsinmyoldhighschooltohavemoreinformationabout University of Technology. References Dr. Tri Dang Faculty of Computer Science and Engineering HCMC University of Technology 268 Ly Thuong Kiet, District 10, Ho Chi Minh City Email: tri.dang@cse.hcmut.edu.vn Dr. Oliver Wang Softfoundry International Pte Ltd 15A Le Thanh Ton, District 1, Ho Chi Minh city. Email: oliver@softfoundry.com MEng. Trang Bui KMS Technology 191B Hoang Van Thu Street. Email: trangbui@kms-technology.com",{"entities":[[0,9,"NAME"],[16,34,"EMAIL"]]}]]}