{"classes":["NAME","EMAIL"],"annotations":[["CURRICULUM VITAE NGUYỄN DUY HẢO PERSONAL INFORMATION Date of birth:December 1st,1991 Mobile: 093.4321.072 – 0964.298.912 Place of birth: NinhBinh Email: nguyenduyhao1111 @gmail.com Nationality: Vietnam Address: 39/45/8, Street No.10, Quarter Gender: Male 3, Linh Xuan Ward, Thu Duc District, Marital status: Single Ho Chi Minh City POSITION APPLIED Junior Ruby on Rails Developer JOB OBJECTIVE To be an active employee in your company and to express and develop my skills for the mutual development of company and myself. Up-to-date on IT developments. EDUCATION BACKGROUND September, 2009 – University of Technical Education Ho Chi Minh City. April,2014 Major: Information Technology ADDITIONAL CERTIFICATION Teaching Teaching Certification level 2 SKILLS English Ability communicationby English Ability reading comprehension material by English Programming Languages C/C++, Ruby,PHP, HTML, CSS, MySQL & Scripting: SDEs tool used Cloud IDE C9 Tool used Teamviewer, Sublime, Notepad++… OS Fedora,Ubuntu Others Good know OOP, MVC HOBBIES Music UK/US, Vpop, rap… Film Action film, Comedy film, … Sport Gym Etc. Like go to traveling, picnic … ADVANTAGES • Good communication. • Good searching skills. • Effectiveness time management. • Able to work independently as well as in a team. • Solving problem. • Planning. • Have a high sense of responsibility. • Self-control. DISADVANTAGES • Need to improve writing, listeningskill in English more. EMPLOYMENT HISTORY  [Full time] Automation Tester at FPT Software 1/2015 – 3/2016 • Review SQL script - stored procedure. • Detect bug in SQL stored procedure and support stuck data integration test. • [WEB] Automation Test use Ruby and Selenium • Embedded script SQL in Ruby • RnD solution auto connect to AWS via two layer security. • RnD gen XML file import data  [Part time ]Web Development Freelancer my self 4/2016 - present  Development web by RoR, PHP with MySQL  OpenCart and Wordpress  Design HTML and CSS layout like facebook  [SEO] Auto post thread have backlink and image  [RoR] Use AWS S3, coffee script, NoSQL  Model programing Map-Reduce with Hadoop, BigData Project • Blog printerested • Language: Ruby • Framework: Rails, Bootstrap • Technology: Amazon Simple Storage Service (S3) • IDE : CLoud IDE C9 • Deploy: Heroku • Database: Active Record • Using Masonry, coffee script • Link : https://pinterested312016.herokuapp.com • Version Control System: Git - Bitbucket Experience • Using Linux : 2 year (Know commands basic in Ubuntu, Fedora) • Using Ruby : 1 year • Using Rails : 3 month • Using SQL : 3 year • Using Sublime Text, Vim: 1 year",{"entities":[[17,31,"NAME"],[153,180,"EMAIL"]]}]]}